HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxHsm_bf.h
/**
 * \file IfxHsm_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC37x_TS_V2.6.0.R0
 * Specification: TC3xx Target Specification.V2.6.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Hsm_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Hsm_Registers
 * 
 */
#ifndef IFXHSM_BF_H
#define IFXHSM_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Hsm_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_HSM_ID_Bits.MOD_REV */
#define IFX_HSM_ID_MOD_REV_LEN (8u)

/** \brief Mask for Ifx_HSM_ID_Bits.MOD_REV */
#define IFX_HSM_ID_MOD_REV_MSK (0xffu)

/** \brief Offset for Ifx_HSM_ID_Bits.MOD_REV */
#define IFX_HSM_ID_MOD_REV_OFF (0u)

/** \brief Length for Ifx_HSM_ID_Bits.MOD_TYPE */
#define IFX_HSM_ID_MOD_TYPE_LEN (8u)

/** \brief Mask for Ifx_HSM_ID_Bits.MOD_TYPE */
#define IFX_HSM_ID_MOD_TYPE_MSK (0xffu)

/** \brief Offset for Ifx_HSM_ID_Bits.MOD_TYPE */
#define IFX_HSM_ID_MOD_TYPE_OFF (8u)

/** \brief Length for Ifx_HSM_ID_Bits.MOD_NUMBER */
#define IFX_HSM_ID_MOD_NUMBER_LEN (16u)

/** \brief Mask for Ifx_HSM_ID_Bits.MOD_NUMBER */
#define IFX_HSM_ID_MOD_NUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_HSM_ID_Bits.MOD_NUMBER */
#define IFX_HSM_ID_MOD_NUMBER_OFF (16u)

/** \brief Length for Ifx_HSM_HT2HSMF_Bits.HT2HSMF */
#define IFX_HSM_HT2HSMF_HT2HSMF_LEN (32u)

/** \brief Mask for Ifx_HSM_HT2HSMF_Bits.HT2HSMF */
#define IFX_HSM_HT2HSMF_HT2HSMF_MSK (0xffffffffu)

/** \brief Offset for Ifx_HSM_HT2HSMF_Bits.HT2HSMF */
#define IFX_HSM_HT2HSMF_HT2HSMF_OFF (0u)

/** \brief Length for Ifx_HSM_HSM2HTF_Bits.HSM2HTF */
#define IFX_HSM_HSM2HTF_HSM2HTF_LEN (32u)

/** \brief Mask for Ifx_HSM_HSM2HTF_Bits.HSM2HTF */
#define IFX_HSM_HSM2HTF_HSM2HTF_MSK (0xffffffffu)

/** \brief Offset for Ifx_HSM_HSM2HTF_Bits.HSM2HTF */
#define IFX_HSM_HSM2HTF_HSM2HTF_OFF (0u)

/** \brief Length for Ifx_HSM_HSM2HTIE_Bits.HSM2HTIE */
#define IFX_HSM_HSM2HTIE_HSM2HTIE_LEN (32u)

/** \brief Mask for Ifx_HSM_HSM2HTIE_Bits.HSM2HTIE */
#define IFX_HSM_HSM2HTIE_HSM2HTIE_MSK (0xffffffffu)

/** \brief Offset for Ifx_HSM_HSM2HTIE_Bits.HSM2HTIE */
#define IFX_HSM_HSM2HTIE_HSM2HTIE_OFF (0u)

/** \brief Length for Ifx_HSM_HSM2HTIS_Bits.HSM2HTIS */
#define IFX_HSM_HSM2HTIS_HSM2HTIS_LEN (32u)

/** \brief Mask for Ifx_HSM_HSM2HTIS_Bits.HSM2HTIS */
#define IFX_HSM_HSM2HTIS_HSM2HTIS_MSK (0xffffffffu)

/** \brief Offset for Ifx_HSM_HSM2HTIS_Bits.HSM2HTIS */
#define IFX_HSM_HSM2HTIS_HSM2HTIS_OFF (0u)

/** \brief Length for Ifx_HSM_HSM2HTS_Bits.HSM2HTS */
#define IFX_HSM_HSM2HTS_HSM2HTS_LEN (32u)

/** \brief Mask for Ifx_HSM_HSM2HTS_Bits.HSM2HTS */
#define IFX_HSM_HSM2HTS_HSM2HTS_MSK (0xffffffffu)

/** \brief Offset for Ifx_HSM_HSM2HTS_Bits.HSM2HTS */
#define IFX_HSM_HSM2HTS_HSM2HTS_OFF (0u)

/** \brief Length for Ifx_HSM_HT2HSMS_Bits.HT2HSMS */
#define IFX_HSM_HT2HSMS_HT2HSMS_LEN (32u)

/** \brief Mask for Ifx_HSM_HT2HSMS_Bits.HT2HSMS */
#define IFX_HSM_HT2HSMS_HT2HSMS_MSK (0xffffffffu)

/** \brief Offset for Ifx_HSM_HT2HSMS_Bits.HT2HSMS */
#define IFX_HSM_HT2HSMS_HT2HSMS_OFF (0u)

/** \brief Length for Ifx_HSM_HSMCTRL_Bits.EOMBT */
#define IFX_HSM_HSMCTRL_EOMBT_LEN (2u)

/** \brief Mask for Ifx_HSM_HSMCTRL_Bits.EOMBT */
#define IFX_HSM_HSMCTRL_EOMBT_MSK (0x3u)

/** \brief Offset for Ifx_HSM_HSMCTRL_Bits.EOMBT */
#define IFX_HSM_HSMCTRL_EOMBT_OFF (0u)

/** \brief Length for Ifx_HSM_DBGBASE_Bits.BASE */
#define IFX_HSM_DBGBASE_BASE_LEN (16u)

/** \brief Mask for Ifx_HSM_DBGBASE_Bits.BASE */
#define IFX_HSM_DBGBASE_BASE_MSK (0xffffu)

/** \brief Offset for Ifx_HSM_DBGBASE_Bits.BASE */
#define IFX_HSM_DBGBASE_BASE_OFF (16u)

/** \brief Length for Ifx_HSM_HSMOTGB_Bits.TGS */
#define IFX_HSM_HSMOTGB_TGS_LEN (2u)

/** \brief Mask for Ifx_HSM_HSMOTGB_Bits.TGS */
#define IFX_HSM_HSMOTGB_TGS_MSK (0x3u)

/** \brief Offset for Ifx_HSM_HSMOTGB_Bits.TGS */
#define IFX_HSM_HSMOTGB_TGS_OFF (0u)

/** \brief Length for Ifx_HSM_HSMOTGB_Bits.TGB */
#define IFX_HSM_HSMOTGB_TGB_LEN (1u)

/** \brief Mask for Ifx_HSM_HSMOTGB_Bits.TGB */
#define IFX_HSM_HSMOTGB_TGB_MSK (0x1u)

/** \brief Offset for Ifx_HSM_HSMOTGB_Bits.TGB */
#define IFX_HSM_HSMOTGB_TGB_OFF (2u)

/** \brief Length for Ifx_HSM_HSMOTGB_Bits.TG_P */
#define IFX_HSM_HSMOTGB_TG_P_LEN (1u)

/** \brief Mask for Ifx_HSM_HSMOTGB_Bits.TG_P */
#define IFX_HSM_HSMOTGB_TG_P_MSK (0x1u)

/** \brief Offset for Ifx_HSM_HSMOTGB_Bits.TG_P */
#define IFX_HSM_HSMOTGB_TG_P_OFF (3u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXHSM_BF_H */
